#include <stdio.h>

int bitCount(int x)
{
    int m1 = 0x11 | (0x11 << 8); //0001000100010001
    int mask = m1 | (m1 << 16);  //00010001000100010001000100010001
    int s = x & mask;
    s += x >> 1 & mask;
    s += x >> 2 & mask;
    s += x >> 3 & mask;                 //(1<=k<=8)第4k位上的数字为x第4k-3到4k位上的1数量的和，最多为4，占3位
    s = s + (s >> 16);                  //(1<=k<=4)第4k+16位上的数字为x第4k-3到4k和第4k+13到4k+16位上的1数量的和，最多为8，占4位
    mask = 0xF | (0xF << 8);            //0000111100001111
    s = (s & mask) + ((s >> 4) & mask); //第24、32位上数字为x（1~8和17~24）、(9~16和24~32)位上1数量的和，最多为16，占5位
    return (s + (s >> 8)) & 0x3F;       //第32位上的数字为x所有位的1数量的和，最多为32(unsigned int)，31(int)位,占5~6位,截取最后6位
}
int main()
{
    int x;
    scanf("%d", &x);
    printf("%d", bitCount(x));
}